OpenFOAM/simple/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          81;
        startFace       1944;
    }
    outlet
    {
        type            patch;
        nFaces          81;
        startFace       2025;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          162;
        startFace       2106;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          162;
        startFace       2268;
    }
)

// ************************************************************************* //
